products/admin/fedexwsdl/RateRequest_ ITAR.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/rate/v13"><SOAP-ENV:Body><RateRequest><WebAuthenticationDetail><UserCredential><Key></Key><Password></Password></UserCredential></WebAuthenticationDetail><ClientDetail><AccountNumber></AccountNumber><MeterNumber></MeterNumber><ClientProductId>WBUS</ClientProductId><ClientProductVersion>0200</ClientProductVersion></ClientDetail><TransactionDetail><CustomerTransactionId>GetRates ITAR IP JP to ID</CustomerTransactionId></TransactionDetail><Version><ServiceId>crs</ServiceId><Major>13</Major><Intermediate>0</Intermediate><Minor>0</Minor></Version><RequestedShipment><ShipTimestamp>2012-01-06T09:30:47-05:00</ShipTimestamp><DropoffType>REGULAR_PICKUP</DropoffType><ServiceType>INTERNATIONAL_PRIORITY</ServiceType><PackagingType>YOUR_PACKAGING</PackagingType><TotalWeight><Units>LB</Units><Value>50.0</Value></TotalWeight><Shipper><AccountNumber></AccountNumber><Contact><CompanyName>FedEx-WAPI</CompanyName><PhoneNumber>1234567890</PhoneNumber></Contact><Address><StreetLines>SN2000 Test Meter 8</StreetLines><StreetLines>10 Fedex Parkway</StreetLines><City>Texas</City><StateOrProvinceCode>IT</StateOrProvinceCode><PostalCode>20098</PostalCode><CountryCode>IT</CountryCode></Address></Shipper><Recipient><AccountNumber></AccountNumber><Contact><PersonName>Recipient Contact</PersonName><PhoneNumber>1234567890</PhoneNumber></Contact><Address><StreetLines>Recipient Address Line 1</StreetLines><StreetLines>Recipient Address Line 2</StreetLines><City>Collierville</City><StateOrProvinceCode>TH</StateOrProvinceCode><PostalCode>10120</PostalCode><CountryCode>TH</CountryCode></Address></Recipient><ShippingChargesPayment><PaymentType>SENDER</PaymentType><Payor><ResponsibleParty><AccountNumber></AccountNumber><Tins><TinType>BUSINESS_STATE</TinType><Number>123456</Number></Tins></ResponsibleParty></Payor></ShippingChargesPayment><SpecialServicesRequested><SpecialServiceTypes>INTERNATIONAL_TRAFFIC_IN_ARMS_REGULATIONS</SpecialServiceTypes><InternationalTrafficInArmsRegulationsDetail><LicenseOrExemptionNumber>String</LicenseOrExemptionNumber></InternationalTrafficInArmsRegulationsDetail></SpecialServicesRequested><CustomsClearanceDetail><DutiesPayment><PaymentType>SENDER</PaymentType><Payor><ResponsibleParty><AccountNumber></AccountNumber><Tins><TinType>BUSINESS_STATE</TinType><Number>213456</Number></Tins><Contact><ContactId>12345</ContactId><PersonName>shriyash</PersonName></Contact></ResponsibleParty></Payor></DutiesPayment><DocumentContent>NON_DOCUMENTS</DocumentContent><CustomsValue><Currency>USD</Currency><Amount>100.00</Amount></CustomsValue><CommercialInvoice><TermsOfSale>FOB_OR_FCA</TermsOfSale></CommercialInvoice><Commodities><NumberOfPieces>1</NumberOfPieces><Description>ABCD</Description><CountryOfManufacture>US</CountryOfManufacture><Weight><Units>LB</Units><Value>1.0</Value></Weight><Quantity>1</Quantity><QuantityUnits>cm</QuantityUnits><UnitPrice><Currency>USD</Currency><Amount>1.000000</Amount></UnitPrice><CustomsValue><Currency>USD</Currency><Amount>100.000000</Amount></CustomsValue></Commodities><ExportDetail><ExportComplianceStatement>30.37(f)</ExportComplianceStatement></ExportDetail></CustomsClearanceDetail><RateRequestTypes>ACCOUNT</RateRequestTypes><PackageCount>1</PackageCount><RequestedPackageLineItems><SequenceNumber>1</SequenceNumber><GroupNumber>1</GroupNumber><GroupPackageCount>1</GroupPackageCount><Weight><Units>LB</Units><Value>20.0</Value></Weight><Dimensions><Length>12</Length><Width>12</Width><Height>12</Height><Units>IN</Units></Dimensions><ContentRecords><PartNumber>123445</PartNumber><ItemNumber>kjdjalsro1262739827</ItemNumber><ReceivedQuantity>12</ReceivedQuantity><Description>ContentDescription</Description></ContentRecords></RequestedPackageLineItems></RequestedShipment></RateRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
